package org.example;

public class TestSQL2 {

    /*
    Структура таблиц:

    Employee:
            *   id (целочисленный, первичный ключ)
            *   name (строка, имя работника)

    Bonus:
            *   id (целочисленный, первичный ключ)
            *   bonus (целочисленный, размер бонуса)
            *   employee_id (целочисленный, внешний ключ, ссылающийся на Employee.id)


     Задача: выбрать имена работников + размер бонусов, у которых бонус менее 1000









     Задача: выбрать имена работников + размер бонусов, у которых бонус менее 1000
     Если бонус == null, то отобразить 0








     */
}
