package org.example;

public class TestSQL3 {

    public static void main(String[] args) {
            /*
   Структура таблиц:


   ActiveUsers: Содержит список id активных пользователей в текущем месяце.
            *   user_id (целочисленный, первичный ключ)

   PreviousMonthUsers: Содержит список id активных пользователей в предыдущем месяце.
            *   user_id (целочисленный, первичный ключ)

    Задача:

    Необходимо получить список id пользователей, которые были активны в предыдущем месяце,
    но не активны в текущем месяце. Т.е. найти пользователей, которые потеряли активность.




     */
    }

}
